package com.usmanov.pushyourself.enums;

public enum TherapyType {
    PSYCHOLOGICAL,
    DIETARY,
    PHYSICAL_REHABILITATION,
    STRESS_MANAGEMENT,
    MEDICAL,
    COUPLES,
    FAMILY,
    ADDICTION,
    SLEEP_TREATMENT,
    MENTAL_HEALTH,
    YOGA,
    ART_THERAPY,
    MINDFULNESS,
    OCCUPATIONAL_THERAPY,
    MUSIC_THERAPY
}

/*
PSYCHOLOGICAL: Психологическая терапия, работа с психоэмоциональными проблемами, такими как депрессия, тревожность, стресс.

DIETARY: Консультации с диетологом, помощь в правильном питании, снижении веса и других аспектах здоровья через диету.

PHYSICAL_REHABILITATION: Реабилитационные программы для людей, восстанавливающихся после травм или операций.

STRESS_MANAGEMENT: Программы, направленные на управление стрессом, с методами расслабления и предотвращения стресса.

MEDICAL: Медицинская терапия, включающая консультации с врачами и терапевтами.

COUPLES: Терапия для пар, помощь в разрешении проблем в отношениях.

FAMILY: Семейная терапия для решения проблем внутри семьи.

ADDICTION: Лечение зависимостей от алкоголя, наркотиков и других веществ.

SLEEP_TREATMENT: Лечение нарушений сна, проблемы с бессонницей, апноэ сна и др.

MENTAL_HEALTH: Общее психическое здоровье, которое может включать депрессию, тревожные расстройства и другие состояния.

YOGA: Терапевтическая йога, которая может использоваться для улучшения физического и ментального состояния.

MINDFULNESS: Практики осознанности (mindfulness) для улучшения психоэмоционального состояния.

ART_THERAPY: Арт-терапия, использование искусства для работы с эмоциями и проблемами.

OCCUPATIONAL_THERAPY: Профессиональная терапия для людей с физическими или когнитивными нарушениями.

MUSIC_THERAPY: Музыкальная терапия для лечения психологических и эмоциональных проблем.
*/
